app/controllers/animals_controller.rb

  def show
    @animal = Animal.find([params[:id]])
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @animal = Animal.create(animal_params)
---
INSERT INTO "animals" ("common_name", "latin_name", "kingdom", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["common_name", "parrot"], ["latin_name", "psittaciformes"], ["kingdom", "animalia"], ["created_at", "2020-06-03 17:12:52.355435"], ["updated_at", "2020-06-03 17:12:52.355435"]]

  def destroy
    @animal = Animal.find(params[:id])
    if @animal.destroy
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "animals" WHERE "animals"."id" = $1  [["id", 2]]

  def update
    animal = Animal.find(params[:id])
    animal.update(animal_params)
---
SELECT "animals".* FROM "animals" WHERE "animals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "animals" SET "common_name" = $1, "latin_name" = $2, "updated_at" = $3 WHERE "animals"."id" = $4  [["common_name", "lion"], ["latin_name", "leo"], ["updated_at", "2020-06-03 17:30:14.324395"], ["id", 1]]