app/controllers/sightings_controller.rb

SELECT "sightings".* FROM "sightings" WHERE 1=1
---
  def index
    @sightings = Sighting.all

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @sighting = Sighting.find([params[:id]])

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "sightings" WHERE "sightings"."id" = $1  [["id", 3]]
---
  def destroy
    @sighting = Sighting.find(params[:id])
    if @sighting.destroy

SELECT "sightings".* FROM "sightings" WHERE "sightings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "sightings" SET "longitude" = $1, "updated_at" = $2 WHERE "sightings"."id" = $3  [["longitude", "23"], ["updated_at", "2020-06-03 18:42:22.703143"], ["id", 2]]
---
  def update
    sighting = Sighting.find(params[:id])
    sighting.update(sighting_params)