app/controllers/sightings_controller.rb

  def index
    @sightings = Sighting.where(date: params[:start_date]..params[:end_date])
---
SELECT "sightings".* FROM "sightings" WHERE "sightings"."date" BETWEEN $1 AND $2  [["date", "2018-06-05 06:05:42"], ["date", "2020-06-05 06:05:42"]]